/**
 * ステージコマンドのうち、そのステージを終了させるものを納める。どれも完了しないコマンドとなる。
 * コマンド内の各キーについては art/map.txt のコマンドに関する説明を参照。
 */

//==========================================================================================================
/**
 * 基底クラス。
 */
class TerminationCommand extends StageCommand {

    //------------------------------------------------------------------------------------------------------
    /**
     * オーバーライド。コマンドが現在実行中かどうかを返す。
     */
    isRunning(stage) {

        // 一度始まると完了することはない。
        return true;
    }
}


//==========================================================================================================
/**
 * type:stair のコマンドを取り扱うクラス。
 */
class StairCommand extends TerminationCommand {

    //------------------------------------------------------------------------------------------------------
    /**
     * オーバーライド。コマンドを実行する。
     */
    run(stage) {

        Acousmato.strikeEffect("walk-staircase-home-descend1");

        stage.changeFloor(this.updown, this.port);
    }
}


//==========================================================================================================
/**
 * type:goal のコマンドを取り扱うクラス。
 */
class GoalCommand extends TerminationCommand {

    //------------------------------------------------------------------------------------------------------
    /**
     * オーバーライド。コマンドを実行する。
     */
    run(stage) {

        // ゴール時SE。
        Acousmato.strikeEffect("walk-gravel1");

        stage.getScene().processGoal();
    }
}


//==========================================================================================================
/**
 * type:miss のコマンドを取り扱うクラス。
 */
class MissCommand extends TerminationCommand {

    //------------------------------------------------------------------------------------------------------
    /**
     * オーバーライド。コマンドを実行する。
     */
    run(stage) {

        stage.getScene().processOver(stage.player);
    }
}
