/**
 * NPCユニットの思考ルーチンを収める。
 */

//==========================================================================================================
/**
 * 基底クラス。
 */
class NpcBrain {

    //------------------------------------------------------------------------------------------------------
    /**
     * @param   思考ルーチンの主体となるUnitExecutant
     */
    constructor(holder) {

        this.holder = holder;
    }

    //------------------------------------------------------------------------------------------------------
    /**
     * 思考対象の StageMap オブジェクトを表す。比較的よく参照するので…
     */
    get map() {

        return this.holder.stage.map;
    }

    //------------------------------------------------------------------------------------------------------
    /**
     * 行動を思考・決定する。
     *
     * @return  決定した移動量を表すPoint。移動しない場合は null。
     */
    decideAction() {

        throw new Error("実装して下さい");
    }
}


//==========================================================================================================
/**
 * ランダムに周辺をうろつくだけの思考ルーチン。
 */
class RoamBrain extends NpcBrain {

    //------------------------------------------------------------------------------------------------------
    decideAction() {

        // 移動力 1 で移動出来る先を取得。
        var choices = this.holder.seatbox.getTravelMarks(1);

        // どれか一つ選択する。
        while(choices.length) {

            // 取得した移動先からランダムに選択すれば良いのだが…
            var choice = choices.popRandom();
            var move = choice.point.clone().sub(this.holder.seatbox.point);

            // 現在居る場所は選択しないように条件を付ける。
            if( !move.equals(Point.ZERO) )  return move;
        }

        // 移動出来ないなら何もしない。
        return null;
    }
}


//==========================================================================================================
class ChaseBrain extends NpcBrain {

    //------------------------------------------------------------------------------------------------------
    decideAction() {

        // プレイヤーの所在位置への経路を取得。取得出来なかった場合は何も行動しない。
        var route = this.holder.seatbox.getStarRoute(this.holder.stage.player.seatbox);
        if(!route)  return null;

        // 経路の一歩目を実行する。
        return Point.numpad( route.charAt(0) );
    }
}
